tutorials/multiphase/cavitatingFoam/throttle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

startFrom                  latestTime;

startTime                  0;

stopAt                     endTime;

endTime                    2e-3;

deltaT                     1e-8;

writeControl               adjustableRunTime;

writeInterval              1e-4;

purgeWrite                 0;

writeFormat                ascii;

writePrecision             6;

writeCompression           uncompressed;

timeFormat                 general;

runTimeModifiable          yes;

adjustTimeStep             on;

maxCo                      0.5;

maxAcousticCo              50.0;

// ************************************************************************* //
